In [10]:
import numpy as np
import pandas as pd

In [11]:
np.random.seed(108)
arr = np.random.randint(0,100, (5,3))
arr

array([[99, 23, 17],
       [75, 86, 82],
       [50, 53,  6],
       [93,  9, 65],
       [ 4, 23, 80]])

In [12]:
df = pd.DataFrame(arr)
df

    0   1   2
0  99  23  17
1  75  86  82
2  50  53   6
3  93   9  65
4   4  23  80

In [14]:
rownames = ['mon', 'tue', 'wed', 'thu', 'fri']
columnnames = ['jan', 'feb', 'mar']
df_named = pd.DataFrame(arr, index=rownames, columns=columnnames)
df_named

     jan  feb  mar
mon   99   23   17
tue   75   86   82
wed   50   53    6
thu   93    9   65
fri    4   23   80